# GetPath Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudType..::..GetPath Method
PointCloudType Class See Also
---
Gets the path of the link source from which the points are loaded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ModelPath GetPath()
```

Visual Basic
---
```text
Public Function GetPath As ModelPath
```

Visual C++
---
```text
public:
ModelPath^ GetPath()
```

# ### Return Value
Returns the file path for a file based point cloud or null for the non-file based point cloud.
# See Also
PointCloudType Class
Autodesk.Revit.DB Namespace